20250811T101023--kdoc-429-組み込みのprintとfmtのprintの違いを見る__permanent.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-03T16:37:50Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 429: 組み込みのprintとfmtのPrintの違いを見る</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 429: 組み込みのprintとfmtのPrintの違いを見る</h1>
<div id="outline-container-orgf851013" class="outline-2">
<h2 id="orgf851013"><a href="#orgf851013">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orgf851013">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org5f2ce7a" class="outline-2">
<h2 id="org5f2ce7a"><a href="#org5f2ce7a">概要</a></h2>
<div class="outline-text-2" id="text-org5f2ce7a">
<p>
Go言語には言語組み込みの <code>print</code> と、  <code>fmt</code> packageの <code>Print</code> がある。どのような違いがあるのだろうか。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>builtin packageのprint</label><pre class="src src-git-permalink">https://github.com/golang/go/blob/988a20c8c5e2c9eb49f8749e5ee94ce3c964fe59/src/builtin/builtin.go#L293-L297
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">// The print built-in function formats its arguments in an
// implementation-specific way and writes the result to standard error.
// Print is useful for bootstrapping and debugging; it is not guaranteed
// to stay in the language.
func print(args ...Type)
</pre>
</div>

<p>
書いてあるとおり、builtin packageの <code>print</code> はデバッグ用のようである。
</p>

<p>
builtin package。
</p>

<ul class="org-ul">
<li>標準エラー出力に書きこむ</li>
<li>残り続ける保証なし</li>
<li><code>print</code>, <code>println</code> しか用意されていない(フォーマット指定はできない)</li>
</ul>

<p>
fmt package。
</p>

<ul class="org-ul">
<li>標準出力に書き込む</li>
<li>さまざまな亜種が用意されている</li>
</ul>
</div>
</div>
<div id="outline-container-orgf6929a8" class="outline-2">
<h2 id="orgf6929a8"><a href="#orgf6929a8">関連</a></h2>
<div class="outline-text-2" id="text-orgf6929a8">
<p>
なし。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
